"""

Домашнее задание №1

Цикл for: Продажи товаров

* Дан список словарей с данными по колличеству проданных телефонов
  [
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470,
                                                    216, 270, 388, 312, 186]},
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354,
                                            276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214,
                                        494, 441, 518, 212, 288, 272, 247]},
  ]
* Посчитать и вывести суммарное количество продаж для каждого товара
* Посчитать и вывести среднее количество продаж для каждого товара
* Посчитать и вывести суммарное количество продаж всех товаров
* Посчитать и вывести среднее количество продаж всех товаров
"""


ALL_SALES = [
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470,
                                            216, 270, 388, 312, 186]},
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354,
                                              276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214,
                                        494, 441, 518, 212, 288, 272, 247]},
]


def main(sales):
    """
    Эта функция вызывается автоматически при запуске скрипта в консоли
    В ней надо заменить pass на ваш код
    """
    sold_result = 0
    average_result = 0
    for model in sales:
        sold = sum(model['items_sold'])
        average = sum(model['items_sold']) / len(model['items_sold'])
        print(f'Суммарное количество продаж {model['product']}: {sold}')
        print(f'Среднее количество продаж {model['product']}: {average}')
        sold_result += sold
        average_result += average
    print(
        f'Суммарное количество продаж всех товаров: {sold_result}',
        f'Среднее количество продаж всех товаров: {average_result}',
    )


if __name__ == "__main__":
    main(ALL_SALES)
